/*********************************************************************************************************************
* @file            car_init.h
* @author
* @version         1.0
* @Target core     CH32V307VCT6
* @date            20220909
********************************************************************************************************************/

#ifndef __CAR_INIT_H
#define __CAR_INIT_H

#include "headfile.h"

//函数声明
/*智能车初始化*/
void car_init(void);
/*中断初始化*/
void int_init(void);

//全局变量声明

#endif
