/*********************************************************************************************************************
 * @file            delay.c
 * @brief           延时函数
 * @author          Fantastic Potato
 * @version         1.0
 * @Target core     CH32V307VCT6
 * @date            2022-3-2
 ********************************************************************************************************************/

#include "delay.h"

/* 全局变量声明 */
static uint8_t  p_us=0;
static uint16_t p_ms=0;
//-------------------------------------------------------------------------------------------------------------------
//  @brief      延时初始化
//  @param      void
//  @return     void
//  Sample usage:           Delay_Init();
//-------------------------------------------------------------------------------------------------------------------
void Delay_Init(void)
{
    p_us=sys_clk/8000000;
    p_ms=(uint16_t)p_us*1000;
}
//-------------------------------------------------------------------------------------------------------------------
//  @brief      us级延时
//  @param      n           延时的时间（us）
//  @return     void
//  Sample usage:           Delay_Us(1000);//延时1000us
//-------------------------------------------------------------------------------------------------------------------
void Delay_Us(uint32_t n)
{
    uint32_t time = n * (SystemCoreClock/8000000);//此处仅仅便于计算，实际上已经有了底层的分频，144000000/8000000=18;
    SysTick->CTLR = 0;
    SysTick->CNT  = 0;
    SysTick->CTLR = 1;          //启动系统计数器 systick（HCLK/8 时基） us,(SystemCoreClock/8000000)表示的就是1us，在控制位开启后，SystemCoreClock就被分频为8了

    while(SysTick->CNT <= time);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ms级延时
//  @param      n           延时的时间（ms）
//  @return     void
//  Sample usage:           Delay_Ms(1000);//延时1000ms
//-------------------------------------------------------------------------------------------------------------------
void Delay_Ms(uint32_t n)
{
    uint32_t time = n * (SystemCoreClock/8000);
    SysTick->CTLR = 0;
    SysTick->CNT  = 0;
    SysTick->CTLR = 1;          //启动系统计数器 systick（HCLK/8 时基） us

    while(SysTick->CNT <= time);
}
