/********************************************************************************************************************
* @file            HF_Wireless_uart.c
* @author
* @version         1.0
* @Target core     CH32V307VCT6
* @date            20220905
********************************************************************************************************************/

#include "HF_Wireless_uart.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块 发送数据
// @param       data            8bit 数据
// @return      uint32          剩余发送长度
// Sample usage:
//-------------------------------------------------------------------------------------------------------------------
uint32 wireless_uart_putchar (uint8 data)
{
    uart_putchar(UART_2, data);                                 // 发送最后的数据

    return 0;
}

//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块 串口接收数据
// @param       data            8bit数据
// @return      void
// Sample usage:
// @note
//-------------------------------------------------------------------------------------------------------------------
uint32 wireless_uart_getchar (uint8 data)
{
    uart_getchar(UART_2);
    return data;
}


//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块 串口发送数据
// @param       buff            数据地址
// @param       len             数据长度
// @return      uint32_t        提示信息
// Sample usage:
// @note
//-------------------------------------------------------------------------------------------------------------------
uint32 wireless_uart_putbuff ( uint8 *buff, uint32 len)
{

    uart_putbuff(UART_2, buff, len);

    return 0;
}

//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块 发送字符串
// @param       *str            要发送的字符串地址
// @return      uint32          剩余发送长度
// Sample usage:                wireless_uart_send_string("hello");
//-------------------------------------------------------------------------------------------------------------------
uint32 wireless_uart_putstr ( uint8 *str)
{

    uart_putstr(UART_2, str);

    return 0;
}



//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块 发送摄像头图像至上位机查看图像
// @param       *image_addr     需要发送的图像地址
// @param       image_size      图像的大小
// @return      void
// Sample usage:                wireless_uart_send_image(&mt9v03x_image[0][0], MT9V03X_IMAGE_SIZE);
//-------------------------------------------------------------------------------------------------------------------
//uint8 wireless_uart_putimage ( uint8 *image_addr, uint32 image_size)
//{
//    extern uint8 camera_send_image_frame_header[4];
//    wireless_uart_send_buff(camera_send_image_frame_header, 4);
//    wireless_uart_send_buff((uint8 *)image_addr, image_size);
//
//    return 0 ;
//}



//-------------------------------------------------------------------------------------------------------------------
// @brief       无线转串口模块初始化
// @param       void
// @return      void
// Sample usage:
// @note
//-------------------------------------------------------------------------------------------------------------------
uint8 wireless_uart_init (void)
{

    uart_init(UART_2, 115200, UART2_TX_A2, UART2_RX_A3);
//    uart_interrupt_init(UART_2,ENABLE,UARTINT_RX);

    return 0;
}
